In [50]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier

In [2]:
data = pd.read_csv('train.csv')

In [10]:
pd.set_option('display.max_columns', None)
data.head(n=15)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.7500,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.0000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.0000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.5250,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.2500,NaN,Q,16,NaN,NaN
5,2.0,0.0,"Gaskell, Mr. Alfred",male,16.0,0.0,0.0,239865,26.0000,NaN,S,NaN,NaN,"Liverpool / Montreal, PQ"
6,2.0,0.0,"Phillips, Mr. Escott Robert",male,43.0,0.0,1.0,S.O./P.P. 2,21.0000,NaN,S,NaN,NaN,"Ilfracombe, Devon"
7,1.0,1.0,"Leader, Dr. Alice (Farnham)",female,49.0,0.0,0.0,17465,25.9292,D17,S,8,NaN,"New York, NY"
8,1.0,0.0,"Brandeis, Mr. Emil",male,48.0,0.0,0.0,PC 17591,50.4958,B10,C,NaN,208.0,"Omaha, NE"
9,2.0,0.0,"Wheeler, Mr. Edwin ""Frederick""",male,NaN,0.0,0.0,SC/PARIS 2159,12.8750,NaN,S,NaN,NaN,NaN
10,2.0,0.0,"Hickman, Mr. Stanley George",male,21.0,2.0,0.0,S.O.C. 14879,73.5000,NaN,S,NaN,NaN,"West Hampstead, London / Neepawa, MB"
11,3.0,1.0,"O'Leary, Miss. Hanora ""Norah""",female,NaN,0.0,0.0,330919,7.8292,NaN,Q,13,NaN,NaN
12,2.0,1.0,"Davies, Mrs. John Morgan (Elizabeth Agnes Mary...",female,48.0,0.0,2.0,C.A. 33112,36.7500,NaN,S,14,NaN,"St Ives, Cornwall / Hancock, MI"
13,2.0,1.0,"Davies, Master. John Morgan Jr",male,8.0,1.0,1.0,C.A. 33112,36.7500,NaN,S,14,NaN,"St Ives, Cornwall / Hancock, MI"
14,3.0,0.0,"Naidenoff, Mr. Penko",male,22.0,0.0,0.0,349206,7.8958,NaN,S,NaN,NaN,NaN

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   cabin      229 non-null    object
 10  embarked   1008 non-null   object
 11  boat       374 non-null    object
 12  body       98 non-null     float64
 13  home.dest  582 non-null    object
dtypes: float64(7), object(7)
memory usage: 110.5+ KB

In [19]:
columns_to_drop = ['name', 'ticket', 'cabin', 'embarked', 'home.dest', 'boat', 'body']

In [20]:
data_clean = data.drop(columns_to_drop,axis=1)
data_clean.head()

   pclass  survived     sex   age  sibsp  parch    fare
0     3.0       0.0  female   NaN    0.0    0.0   7.750
1     2.0       0.0    male  39.0    0.0    0.0  26.000
2     2.0       1.0  female  40.0    0.0    0.0  13.000
3     3.0       1.0  female  31.0    1.0    1.0  20.525
4     3.0       1.0  female   NaN    2.0    0.0  23.250

In [26]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int32
 3   age       1009 non-null   float64
 4   sibsp     1009 non-null   float64
 5   parch     1009 non-null   float64
 6   fare      1009 non-null   float64
dtypes: float64(6), int32(1)
memory usage: 51.4 KB

In [22]:
le = LabelEncoder()
data_clean["sex"] = le.fit_transform(data_clean["sex"])

In [23]:
data_clean.head()

   pclass  survived  sex   age  sibsp  parch    fare
0     3.0       0.0    0   NaN    0.0    0.0   7.750
1     2.0       0.0    1  39.0    0.0    0.0  26.000
2     2.0       1.0    0  40.0    0.0    0.0  13.000
3     3.0       1.0    0  31.0    1.0    1.0  20.525
4     3.0       1.0    0   NaN    2.0    0.0  23.250

In [25]:
data_clean = data_clean.fillna(data_clean["age"].mean())

In [27]:
input_cols = ['pclass',"sex","age","sibsp","parch","fare"]
output_cols = ["survived"]

X = data_clean[input_cols]
Y = data_clean[output_cols]

In [28]:
print(X.shape, Y.shape)

(1009, 6) (1009, 1)

In [46]:
rf = RandomForestClassifier(n_estimators=30,criterion='entropy',max_depth=7)

In [47]:
rf.fit(X,Y)

<ipython-input-47-22c431481a46>:1: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rf.fit(X,Y)

RandomForestClassifier(criterion='entropy', max_depth=7, n_estimators=30)

In [48]:
rf.score(X,Y)

0.8632309217046581

In [33]:
from sklearn.model_selection import GridSearchCV

In [37]:
params = [
    {
        'n_estimators':[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150],
        'criterion':['entropy', 'gini'],
        'max_depth':[2,3,4,5,6,7,8,8,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25]
    }   
]

In [51]:
DecisionTreeClassifier?

In [55]:
gs = GridSearchCV(estimator=RandomForestClassifier(),param_grid=params,scoring="accuracy",cv=5,n_jobs = 4)

In [43]:
gs.fit(X,Y.values.ravel())

GridSearchCV(cv=5, estimator=RandomForestClassifier(), n_jobs=4,
             param_grid=[{'criterion': ['entropy', 'gini'],
                          'max_depth': [2, 3, 4, 5, 6, 7, 8, 8, 10, 11, 12, 13,
                                        14, 15, 16, 17, 18, 19, 20, 21, 22, 23,
                                        24, 25],
                          'n_estimators': [10, 20, 30, 40, 50, 60, 70, 80, 90,
                                           100, 110, 120, 130, 140, 150]}],
             scoring='accuracy')

In [44]:
gs.best_estimator_

RandomForestClassifier(max_depth=7, n_estimators=30)

In [45]:
gs.best_score_

0.8156445495295799

In [52]:
params1 = [
    {
        'criterion':['entropy', 'gini'],
        'max_depth':[2,3,4,5,6,7,8,8,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25]
    }   
]

In [57]:
gs_1 = GridSearchCV(estimator=DecisionTreeClassifier(),param_grid=params1,scoring="accuracy",cv=5,n_jobs = 4)

In [58]:
gs_1.fit(X, Y)

GridSearchCV(cv=5, estimator=DecisionTreeClassifier(), n_jobs=4,
             param_grid=[{'criterion': ['entropy', 'gini'],
                          'max_depth': [2, 3, 4, 5, 6, 7, 8, 8, 10, 11, 12, 13,
                                        14, 15, 16, 17, 18, 19, 20, 21, 22, 23,
                                        24, 25]}],
             scoring='accuracy')

In [60]:
gs_1.best_estimator_

DecisionTreeClassifier(criterion='entropy', max_depth=3)

In [61]:
gs_1.best_score_

0.7997832619082803

In [76]:
sk_tree = DecisionTreeClassifier(criterion='entropy',max_depth=3)

In [77]:
sk_tree.fit(X, Y)

DecisionTreeClassifier(criterion='entropy', max_depth=3)

In [78]:
sk_tree.score(X, Y)

0.8116947472745293

In [79]:
test_data = pd.read_csv('Test.csv')

In [80]:
test_data_clean = test_data.drop(columns_to_drop,axis=1)

In [82]:
le = LabelEncoder()
test_data_clean["sex"] = le.fit_transform(test_data_clean["sex"])
test_data_clean = test_data_clean.fillna(test_data_clean["age"].mean())

In [83]:
test_data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  300 non-null    float64
 1   sex     300 non-null    int32
 2   age     300 non-null    float64
 3   sibsp   300 non-null    float64
 4   parch   300 non-null    float64
 5   fare    300 non-null    float64
dtypes: float64(5), int32(1)
memory usage: 13.0 KB

In [134]:
res = rf.predict(test_data_clean)

In [158]:
type(res[0])

numpy.float64

In [141]:
output = []
for i in range(idx.shape[0]):
    output.append([i, res[i]])

In [147]:
output1 = np.array(output, dtype='int32')

In [155]:
out_df = pd.DataFrame(output_1, columns=['Id','survived'], dtype='int32')

In [163]:
out_df.head(n = 10)

   Id  survived
0   0       0.0
1   1       0.0
2   2       0.0
3   3       0.0
4   4       0.0
5   5       1.0
6   6       0.0
7   7       0.0
8   8       0.0
9   9       0.0

In [161]:
out_df = out_df.astype({"Id": int, "survived": float})

In [164]:
out_df.to_csv("res.csv", index=False, index_label=False)